# brew taps
tap "buo/cask-upgrade"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jawshooah/pyenv"
tap "jjangsangy/packages"
tap "neovim/neovim"
cask "osxfuse"

# brew packages
brew "mas"
brew "libpng"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "libffi"
brew "openssl@1.1"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "python@3.8"
brew "jpeg"
brew "pkg-config"
brew "icu4c"
brew "pango"
brew "librsvg"
brew "c-ares"
brew "gcc"
brew "gflags"
brew "protobuf"
brew "grpc"
brew "apache-arrow"
brew "apache-spark"
brew "apm-bash-completion"
brew "aria2"
brew "boost"
brew "asciidoctor"
brew "atomicparsley"
brew "autoconf"
brew "automake"
brew "autossh"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bashdb"
brew "berkeley-db@4"
brew "bison"
brew "brew-cask-completion"
brew "ccache"
brew "cdrtools"
brew "cmake"
brew "eigen"
brew "ceres-solver"
brew "certbot"
brew "chrome-cli"
brew "clang-format"
brew "clblas"
brew "clinfo"
brew "cmark"
brew "node"
brew "code-server"
brew "coreutils"
brew "cryfs"
brew "ctags"
brew "libevent"
brew "rtmpdump"
brew "curl"
brew "go"
brew "dep"
brew "dfu-util"
brew "direnv"
brew "dive"
brew "django-completion"
brew "docutils"
brew "dos2unix"
brew "encfs"
brew "enchant"
brew "exif"
brew "exiftool"
brew "expat"
brew "ext4fuse"
brew "fd"
brew "libtool"
brew "gnutls"
brew "little-cms2"
brew "webp"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "rav1e"
brew "sdl2"
brew "tesseract"
brew "x264"
brew "x265"
brew "ffmpeg"
brew "open-mpi"
brew "flex"
brew "fselect"
brew "fzf"
brew "gawk"
brew "geckodriver"
brew "gh"
brew "ghostscript", link: false
brew "gist"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "libgcrypt"
brew "gnupg", link: false
brew "go-md2man"
brew "gocryptfs"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "vala"
brew "guetzli"
brew "haskell-stack"
brew "hdf5"
brew "helm"
brew "helmfile"
brew "highlight"
brew "hopenpgp-tools"
brew "htop"
brew "hub"
brew "imagemagick"
brew "iperf3"
brew "ipfs"
brew "jack"
brew "jq"
brew "k9s"
brew "keychain"
brew "kube-ps1"
brew "kubectx"
brew "lastpass-cli"
brew "launchctl-completion"
brew "lbzip2"
brew "libaacs"
brew "libarchive"
brew "libcaca"
brew "libdnet"
brew "libdvdnav"
brew "libmaxminddb"
brew "libnotify"
brew "libpcap"
brew "libpgm"
brew "libresample"
brew "libscrypt"
brew "libsecret"
brew "libsodium"
brew "libunwind-headers"
brew "libxml2"
brew "libxslt"
brew "libzip"
brew "lrzip"
brew "lua@5.1", link: false
brew "luajit"
brew "luarocks"
brew "make"
brew "makedepend"
brew "maven"
brew "media-info"
brew "megatools"
brew "mercurial"
brew "miniupnpc"
brew "mitmproxy"
brew "mkcert"
brew "mkvtoolnix", link: false
brew "molten-vk"
brew "zeromq"
brew "monero"
brew "mosh"
brew "mozjpeg"
brew "mujs"
brew "nasm"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nnn"
brew "nss"
brew "nvm"
brew "nyx"
brew "nzbget"
brew "tor"
brew "onioncat"
brew "opam"
brew "open-completion"
brew "optipng"
brew "p7zip"
brew "pandoc"
brew "pastebinit"
brew "pgcli"
brew "pigz"
brew "pinentry-mac"
brew "pip-completion"
brew "pipenv"
brew "pixz"
brew "platformio"
brew "plzip"
brew "postgresql"
brew "privoxy"
brew "terminal-notifier"
brew "profanity"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "qemu"
brew "qrencode"
brew "qt"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-use"
brew "rbenv-vars"
brew "rdesktop"
brew "redis"
brew "redsocks"
brew "ripgrep"
brew "rsync"
brew "rustc-completion"
brew "rustup-init"
brew "s3fs"
brew "sbt"
brew "scala"
brew "screen"
brew "securefs"
brew "selenium-server-standalone"
brew "shadowsocks-libev"
brew "shellcheck"
brew "shfmt"
brew "shtool"
brew "sip"
brew "socat"
brew "sops"
brew "sox"
brew "sphinx-doc"
brew "stern"
brew "stunnel"
brew "subliminal"
brew "tcl-tk"
brew "tcpdump"
brew "telnet"
brew "terraform"
brew "texi2html"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tmux"
brew "torsocks"
brew "tree"
brew "uchardet"
brew "unrar"
brew "vapoursynth"
brew "vapoursynth-imwri"
brew "vapoursynth-ocr"
brew "watch"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "wireshark"
brew "ykpers"
brew "ykman"
brew "ykneomgr"
brew "z3"
brew "zlib"
brew "heroku/brew/heroku"
brew "jjangsangy/packages/ffmpeg", args: ["with-dav1d", "with-fdk-aac", "with-game-music-emu", "with-gmp", "with-kvazaar", "with-libbluray", "with-libbs2b", "with-libcaca", "with-libgcrypt", "with-libgsm", "with-libmodplug", "with-librsvg", "with-libsoxr", "with-libssh", "with-libvidstab", "with-libvmaf", "with-libxml2", "with-opencore-amr", "with-openh264", "with-openjpeg", "with-rav1e", "with-rubberband", "with-speex", "with-tesseract", "with-two-lame", "with-wavpack", "with-webp", "with-xvid", "with-zeromq", "with-zimg"]
brew "jjangsangy/packages/mpv", args: ["with-app", "with-dav1d"]

# install casks
cask "alacritty"
cask "aws-vault"
cask "balenaetcher"
cask "betterzip"
cask "calibre"
cask "crunch"
cask "dash"
cask "deluge"
cask "discord"
cask "docker-edge"
cask "electrum"
cask "firefox"
cask "folx"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "handbrake"
cask "invisor-lite"
cask "ipfs"
cask "java8"
cask "jdownloader"
cask "jupyter-notebook-viewer"
cask "keka"
cask "kekadefaultapp"
cask "kindle"
cask "launchcontrol"
cask "lens"
cask "mediainfo"
cask "megacmd"
cask "miktex-console"
cask "mkvtoolnix"
cask "monero-wallet"
cask "mono-mdk"
cask "mpv"
cask "multipass"
cask "netron"
cask "nordvpn"
cask "nzbget"
cask "onionshare"
cask "open-in-code"
cask "persepolis-download-manager"
cask "postico"
cask "provisionql"
cask "qladdict"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlmobi"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookapk"
cask "quicklookase"
cask "sabnzbd"
cask "sequel-pro"
cask "slack"
cask "sonarr"
cask "spotify"
cask "suspicious-package"
cask "thunderbird"
cask "transmission"
cask "tribler"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc-nightly"
cask "webpquicklook"
cask "xquartz"
cask "zenmap"

# install from app store
mas "", id: 1333542190 # 1Password

# vi: ft=ruby
