autoconf
automake
bash
bison
boost
boost-python
brew-cask
cabal-install
cairo
cloog
cmake
coreutils
cscope
ecj
exercism
faac
fdk-aac
ffmpeg
fontconfig
freetype
frei0r
fribidi
gcc
gdbm
gettext
ghc
git-cal
glib
gmp
go
htop-osx
hub
isl
jpeg
jq
lame
libass
libbluray
libcaca
libffi
libmpc
libogg
libpng
libquvi
libsodium
libtiff
libtool
libvidstab
libvo-aacenc
libvorbis
libvpx
little-cms2
lua
luajit
macvim
mariadb
mercurial
mpfr
numpy
openblas
opencore-amr
openjpeg
openssl
opus
orc
pandoc
pcre
pixman
pkg-config
py2cairo
pyqt
python
python3
qt
readline
rtmpdump
schroedinger
scipy
sdl
shellcheck
sip
speex
sqlite
swig
texi2html
the_silver_searcher
theora
x264
x265
xvid
xz
yasm
youtube-dl
zeromq
