ant
autoconf
automake
bash
bash-completion
bison
boost
boost-python
brew-cask
cairo
cask
cgal
cmake
coreutils
curl
dirmngr
docker
docker-machine
docker-swarm
dockutil
emacs
faac
fdk-aac
ffmpeg
fig
flann
fontconfig
freetype
freexl
frei0r
fribidi
gcc
gdal
gdbm
geoip
geos
gettext
giflib
gist
git
glib
gmp
gnupg2
go
gpg-agent
gpp
hdf5
hub
icu4c
isl
jpeg
jq
json-c
lame
libass
libassuan
libbluray
libcaca
libevent
libffi
libgaiagraphics
libgcrypt
libgeotiff
libgpg-error
libharu
libksba
liblwgeom
libmaxminddb
libmpc
libogg
libpng
libquvi
librasterlite
libsoxr
libspatialite
libssh
libtiff
libtool
libusb
libusb-compat
libvidstab
libvo-aacenc
libvorbis
libvpx
libxml2
libyaml
little-cms2
lua
lzlib
mercurial
mpfr
mplayer
neovim
node
oniguruma
opencore-amr
openjpeg
openssl
opus
orc
panamax
pandoc
pcre
pinentry
pixman
pkg-config
postgis
postgresql
proj
pth
python
python3
rbenv
rbenv-aliases
rbenv-bundler
rbenv-use
rbenv-whatis
readline
redis
rtmpdump
ruby-build
schroedinger
sdl
sfcgal
spatialite-gui
speex
sqlite
szip
texi2html
the_silver_searcher
theora
tor
webp
wget
wxmac
x264
x265
xvid
xz
yasm
youtube-dl
zeromq
