AtomicParsley
ant
autoconf
automake
bash
bash-completion
cairo
cgal
cmake
coreutils
curl
docker
docker-compose
docker-machine
docker-swarm
dockutil
faac
fdk-aac
ffmpeg
flann
fontconfig
freetype
gcc
gdbm
gettext
giflib
gist
git
gnupg2
go
gpp
hdf5
hub
icu4c
isl
jq
libmpc
libogg
libpng
libsoxr
libspatialite
libssh
libtiff
libvidstab
libvo-aacenc
libvorbis
libvpx
libxml2
libyaml
lua
lzlib
mercurial
mpfr
mplayer
neovim
node
openssl
pandoc
pcre
pinentry
pkg-config
postgis
postgresql
python
python3
rbenv
rbenv-aliases
rbenv-bundler
rbenv-use
rbenv-whatis
readline
ruby-build
speex
sqlite
szip
the_silver_searcher
tor
webp
wget
yasm
youtube-dl
zeromq
